In [2]:
import pandas as pd

df = pd.read_csv("tas-python-workshop-sheet.csv")

In [3]:
df

     Time   Courses                                   Full Name  Grade Average
0   Y19T1  ECON1101                Principles of Microeconomics             53
1   Y19T1  COMP1511                    Programming Fundemantals             87
2   Y19T1  MATH1141                       Higher Mathematics 1A             76
3   Y19T2  DATA1001  Introduction to Data Science and Decisions             80
4   Y19T2  MATH1231                              Mathematics 1B             92
5   Y19T3  COMP1531           Software Engineering Fundamentals             76
6   Y19T3  COMP2521              Data Structures and Algorithms             83
7   Y19T3  MATH1081                        Discrete Mathematics             64
8   Y20T1  ECON2112           Game Theory and Business Strategy             58
9   Y20T1  ARTS2375                         Philosophical Logic             88
10  Y20T2  COMP2041                       Software Construction             80
11  Y20T2  COMP3121         Algorithms & Programming Techniques             90
12  Y20T3  COMP1521               Computer Systems Fundamentals             87
13  Y20T3  COMP2511        Object-Oriented Design & Programming             84
14  Y20T3  COMP3311                            Database Systems             69
15    Y20  ENGG2600                             Sunswift Year 1             80
16  Y21T0  COMP3511                  Human Computer Interaction             76
17  Y21T1  COMP6080                   Web Front-End Programming             80
18  Y21T1  COMP3411                     Artificial Intelligence             87

In [4]:
df[df['Grade Average'] > 80]

     Time   Courses                             Full Name  Grade Average
1   Y19T1  COMP1511              Programming Fundemantals             87
4   Y19T2  MATH1231                        Mathematics 1B             92
6   Y19T3  COMP2521        Data Structures and Algorithms             83
9   Y20T1  ARTS2375                   Philosophical Logic             88
11  Y20T2  COMP3121   Algorithms & Programming Techniques             90
12  Y20T3  COMP1521         Computer Systems Fundamentals             87
13  Y20T3  COMP2511  Object-Oriented Design & Programming             84
18  Y21T1  COMP3411               Artificial Intelligence             87

In [5]:
df.head()

    Time   Courses                                   Full Name  Grade Average
0  Y19T1  ECON1101                Principles of Microeconomics             53
1  Y19T1  COMP1511                    Programming Fundemantals             87
2  Y19T1  MATH1141                       Higher Mathematics 1A             76
3  Y19T2  DATA1001  Introduction to Data Science and Decisions             80
4  Y19T2  MATH1231                              Mathematics 1B             92

In [6]:
df.tail()

     Time   Courses                   Full Name  Grade Average
14  Y20T3  COMP3311            Database Systems             69
15    Y20  ENGG2600             Sunswift Year 1             80
16  Y21T0  COMP3511  Human Computer Interaction             76
17  Y21T1  COMP6080   Web Front-End Programming             80
18  Y21T1  COMP3411     Artificial Intelligence             87

In [7]:
df.describe()

       Grade Average
count      19.000000
mean       78.421053
std        10.725441
min        53.000000
25%        76.000000
50%        80.000000
75%        87.000000
max        92.000000

In [8]:
def get_year(time):
    if (time[0] == 'Y'):
        return int(time[1]+time[2]) + 2000

def get_term_num(time):
    if (len(time) > 3 and time[3] == 'T'):
        return int(time[4])

def get_grade_letter(mark):
    if (mark >= 85):
        return "HD"
    elif (mark >= 75):
        return "DN"
    elif (mark >= 65):
        return "CR"
    elif (mark >= 50):
        return "PS"
    else:
        return "FL"

In [9]:
get_year("Y20T2")

2020

In [10]:
get_term_num("Y20T1")

1

In [11]:
df['Year']=df[['Time']].apply(lambda x: get_year(*x), axis=1)

In [13]:
df.head()

,Time,Courses,Full Name,Grade Average,Year
0,Y19T1,ECON1101,Principles of Microeconomics,53,2019
1,Y19T1,COMP1511,Programming Fundemantals,87,2019
2,Y19T1,MATH1141,Higher Mathematics 1A,76,2019
3,Y19T2,DATA1001,Introduction to Data Science and Decisions,80,2019
4,Y19T2,MATH1231,Mathematics 1B,92,2019